far-mat42/custom-escooter/BMS PCB/Testing/STM32 Testing Ground/Nucleo-Test-Ground-2/Core/Src/main.c
#include "stm32l4xx_hal.h"
#include "bq76952.h"
#include <math.h>
#include <stdbool.h>
#include <string.h>
#include <stdio.h>
#include <time.h>

// Function prototypes
// Initializing peripherals
void SystemClock_Config(void);
void GPIO_Init(void);
void SPI1_Init(void);
void USART1_Init(void);
void TIM1_Init(void);
void TIM2_Init(void);
void ADC1_Init(void);
void RTC_Init(void);

uint8_t crc8(uint8_t *data, size_t len);

// Functions to handle communication with the AFE
void DirectCmdRead(uint8_t cmd, uint8_t *returnData, uint8_t len);
void DirectCmdWrite(uint8_t cmd, uint8_t *writeData, uint8_t len);
void SubCmdNoData(uint16_t cmd);
void SubCmdReadData(uint16_t cmd, uint8_t *returnData, uint8_t len);
void RAMRegisterRead(uint16_t addr, uint8_t *returnData, uint8_t len);
void RAMRegisterWrite(uint16_t addr, uint8_t *writeData, uint8_t len);
void RAMRegisterInit(void);

// Helper functions that do the handling for verifying the AFE received a SPI command
void AFETransmitReadCmd(uint8_t *txBytes, uint8_t *rxBytes, uint8_t arrSize);
void AFETransmitWriteCmd(uint8_t *txBytes, uint8_t *rxBytes, uint8_t arrSize);

// Helper functions to transmit the data from the AFE to the UART lines
void TransmitLogAndTimestamp(void);
void TransmitCellPackVoltages(uint16_t *volts, uint8_t len);
void TransmitADCReadings(uint32_t *counts, uint8_t len);
void TransmitCurrentReading(int16_t current);
void TransmitTemperatures(int16_t *temps, uint8_t len);
void TransmitSafetyStatusA(void);
void TransmitSafetyStatusB(void);

// Other miscellaneous helper functions
void EnterShutdown(void);
int16_t T4_Acquire(void);
time_t RTCToUnixTimestamp(RTC_DateTypeDef *date, RTC_TimeTypeDef *time);
void GetDateTime(char *datetimeStr, size_t size);

void Error_Handler(void);

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin);

// Global defines
#define T4_BETA 3435.0
#define T4_R0 10000.0
#define T4_PU_R 17800.0
#define T4_PU_V 3.3
#define V_REF 2.048

// Global handles
SPI_HandleTypeDef hspi1;
UART_HandleTypeDef huart1;
TIM_HandleTypeDef htim1;
ADC_HandleTypeDef hadc1;
RTC_HandleTypeDef hrtc;

// Global variables - used for ISRs to raise flags
bool logDataFlag = 0;
bool logAlertsFlag = 0;
bool shutdownFlag = 0;
bool wakeUpFlag = 0;

int main(void) {
    // HAL initialization
    HAL_Init();

    // System clock configuration
    SystemClock_Config();

    // Initialize GPIO, SPI, UART, TIM1, ADC1
    GPIO_Init();
    SPI1_Init();
    USART1_Init();
    TIM1_Init();
    TIM2_Init();
    ADC1_Init();
    RTC_Init();

    // Start the logging timer
    TIM1->CR1 |= TIM_CR1_CEN;

    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_RESET); // Turn off heartbeat

    // Blank array to store data from any commands that receive data
    uint8_t readData[32] = {0};

    uint16_t ctrlStatus = 0;
    uint16_t cellVolt = 0;
    uint16_t cellVolts[17] = {0};
    int16_t cellGains[16] = {12000, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 11900};
    uint32_t MCUTemperature = 0;
    int16_t AFETemperature = 0;
    int16_t temperatures[4] = {0};
    int16_t currentRead = 0;
    uint8_t fetStatus = 0;
    uint8_t cmdAddr = 0;

    uint8_t writeData[32] = {0};

    // Read battery status register and manufacturing status register
	DirectCmdRead(0x12, readData, 2);
	SubCmdReadData(0x0057, readData, 2);
	HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_5);
	HAL_Delay(250);
	HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_5);
	HAL_Delay(750);

	// Disable SLEEP mode and disable FET_TEST mode if already in FET_TEST
	SubCmdNoData(0x009A);
	if (!(readData[0] & (1 << 4))) SubCmdNoData(0x0022);

	// Read battery status register and manufacturing status register
	DirectCmdRead(0x12, readData, 2);
	SubCmdReadData(0x0057, readData, 2);

	// Enter CONFIG_UPDATE mode
	SubCmdNoData(0x0090);
	// Wait for Battery Status to confirm transition to CONFIG_UPDATE mode
	do {
		DirectCmdRead(0x12, readData, 2);
	} while (!(readData[0] & 0x01));

	// Program configuration for all AFE registers
	RAMRegisterInit();

	/**
	 * Set calibration gain values for all cell voltages
	 */
	for (int i = 0; i < 16; i++) {
		format_int16(writeData, cellGains[i]);
		RAMRegisterWrite(CAL_GAIN_CL1 + i*2, writeData, 2);
	}

	// Exit CONFIG_UPDATE mode, disable SLEEP mode, read manufacturing status register again
	SubCmdNoData(0x0092);
	SubCmdNoData(0x009A);
	SubCmdReadData(0x0057, readData, 2);
	// Read battery status register
	DirectCmdRead(0x12, readData, 2);

	// Blink status LED a few times to indicate setup is complete
	for (int i = 0; i < 10; i++) {
		HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_5);
		HAL_Delay(100);
	}

	// Clear bits in the alarm registers
	writeData[0] = 0xFF;
	writeData[1] = 0xFE;
	DirectCmdWrite(0xE2, writeData, 2);

    while (1) {
    	// Check if flag to shutdown was raised
    	if (shutdownFlag) {
    		shutdownFlag = false; // Clear the flag
    		// Blinking LED to indicate it's entering shutdown
    		for (int i = 0; i < 6; i++) {
    			HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_5);
				HAL_Delay(100);
    		}

    		EnterShutdown();
    	}

    	// Check if flag to wake up the AFE was raised
    	if (wakeUpFlag) {
    		wakeUpFlag = false; // Clear the flag
    		// Blinking LED to indicate it's waking up
			for (int i = 0; i < 6; i++) {
				HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_5);
				HAL_Delay(100);
			}
			// Waking up the AFE
    		SubCmdNoData(0x000E);
    	}

    	// Check if flag to log data was raised
    	if (logDataFlag) {
    		logDataFlag = false; // Clear the flag
    		//TODO: Only read measurements if FULLSCAN bit of Alarm Status is set, then clear bit after reading measurements
    		// Enable status LED to indicate data being logged
    		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);
    		// Read the cell voltage for all 16 cells and then the pack voltage
			for (int i = 0; i < 17; i++) {
				cmdAddr = 0x14 + 2*i;
				DirectCmdRead(cmdAddr, readData, 2);
				// Combine the 2 8-bit cell voltage bytes into a single 16-byte variable
				cellVolt = (readData[0]) + (readData[1] << 8);
				cellVolts[i] = cellVolt;
			}

			// Read the AFETemperature measured at TS1-3
			for (int i = 0; i < 3; i++) {
				cmdAddr = 0x70 + 2*i;
				DirectCmdRead(cmdAddr, readData, 2);
				AFETemperature = (readData[0]) + (readData[1] << 8);
				temperatures[i] = AFETemperature;
			}
			// Calculate temperature measured by MCU's ADC
			MCUTemperature = T4_Acquire();
			temperatures[3] = MCUTemperature;

