far-mat42/custom-escooter/BMS PCB/Testing/STM32 Testing Ground/Nucleo-Test-Ground-2/Core/Src/main.c
	// Calculate the check-sum and write it to the AFE's checksum register
	uint8_t checkSum = 0;
	for (int i = 0; i < len; i++) {
		checkSum += writeData[i];
	}
	checkSum += lowerAddr[1];
	checkSum += upperAddr[1];
	checkSum = ~(checkSum);

	writeBytes[0] = WRITE_CHECKSUM_ADDR;
	writeBytes[1] = checkSum;

	txData[0] = writeBytes[0];
	txData[1] = writeBytes[1];
	txData[2] = crc8(writeBytes, 2); // Recalculate CRC

	AFETransmitWriteCmd(txData, rxData, sizeof(txData));

	// Write the data length to the AFE's data length register
	writeBytes[0] = WRITE_DATALEN_ADDR;
	writeBytes[1] = len + 4; // Length of data buffer, plus upper and lower address bytes, plus checksum and data length bytes

	txData[0] = writeBytes[0];
	txData[1] = writeBytes[1];
	txData[2] = crc8(writeBytes, 2); // Recalculate CRC

	AFETransmitWriteCmd(txData, rxData, sizeof(txData));
}

/**
 * Programs all the relevant AFE registers. To be used whenever BMS powers on or AFE enters SHUTDOWN
 */
void RAMRegisterInit(void) {
	// Initializing buffer for writing data to AFE
	uint8_t writeData[32] = {0};

	/**
	 * Configuration settings registers
	 */
	// Power configuration
	format_uint16(writeData, 0x2D81);
	RAMRegisterWrite(SET_CONF_PWR, writeData, 2); // Keep AFE's LDOs in the same state when entering DEEPSLEEP
	// Configure TS pins
	writeData[0] = 0x07; // TS1 & TS2: Thermistor temperature, for cell temperature protection
	RAMRegisterWrite(SET_CONF_TS1_CFG, writeData, 1);
	RAMRegisterWrite(SET_CONF_TS2_CFG, writeData, 1);
	writeData[0] = 0x0F; // TS3: Thermistor temperature, for FET temperature protection
	RAMRegisterWrite(SET_CONF_TS3_CFG, writeData, 1);
	// Configure ALERT pin
	writeData[0] = 0x2A;
	RAMRegisterWrite(SET_CONF_ALERT_CFG, writeData, 1);
	// Configure DA
	writeData[0] = 0x06;
	RAMRegisterWrite(SET_CONF_DA_CFG, writeData, 1);

	/**
	 * Protection settings registers
	 */
	writeData[0] = 0xFC;
	RAMRegisterWrite(SET_PROT_ENPROT_A, writeData, 1); // Enables SCD, OCD1, OCC, COV, CUV protection
	writeData[0] = 0xF7;
	RAMRegisterWrite(SET_PROT_ENPROT_B, writeData, 1); // Enables OTF, OTINT, OTD, OTC, and all UT protection
	writeData[0] = 0x00;
	RAMRegisterWrite(SET_PROT_ENPROT_C, writeData, 1); // Disables all special/latch protections
	writeData[0] = 0x98;
	RAMRegisterWrite(SET_PROT_CHGFET_PROT_A, writeData, 1); // SCD, OCC, and COV disable CHG FET
	writeData[0] = 0xD4;
	RAMRegisterWrite(SET_PROT_CHGFET_PROT_B, writeData, 1); // OTF, OTINT, OTC, and UTINT disable CHG FET
	writeData[0] = 0x00;
	RAMRegisterWrite(SET_PROT_CHGFET_PROT_C, writeData, 1); // Type C protections are disabled anyways
	writeData[0] = 0xE4;
	RAMRegisterWrite(SET_PROT_DSGFET_PROT_A, writeData, 1); // SCD, OCD1, OCD2, and CUV disable DSG FET
	writeData[0] = 0xE4;
	RAMRegisterWrite(SET_PROT_DSGFET_PROT_B, writeData, 1); // OTF, OTINT, OTD, and UTINT disable DSG FET
	writeData[0] = 0x00;
	RAMRegisterWrite(SET_PROT_DSGFET_PROT_C, writeData, 1); // Type C protections are disabled anyways

	/**
	 * FET settings registers
	 */
	writeData[0] = 0x1E;
	RAMRegisterWrite(SET_FET_OPTIONS, writeData, 1); // Enable PDSG, disable body diode protection, enable CHG FET in SLEEP
	format_uint16(writeData, 0x06A4);
	RAMRegisterWrite(SET_FET_PCHG_STRT_V, writeData, 2); // Min. cell voltage below 1700mV activates PCHG mode
	format_uint16(writeData, 0x06D6);
	RAMRegisterWrite(SET_FET_PCHG_STP_V, writeData, 2); // Min. cell voltage above 1750mV deactivates PCHG mode
	writeData[0] = 0x64;
	RAMRegisterWrite(SET_FET_PDSG_TO, writeData, 1); // PDSG timeout after 1000ms, enables DSG FET after
	writeData[0] = 0x64;
	RAMRegisterWrite(SET_FET_PDSG_STP_DLT, writeData, 1); // Exit PDSG and enable DSG FET when LD equals VBAT+ minus 1000mV

	/**
	 * Misc. settings
	 */
	// Setting MFG Status Init to disable FET Test commands
	format_uint16(writeData, 0x0050);
	RAMRegisterWrite(SET_MFG_STATUS_INIT, writeData, 2);
	// Setting DSG threshold to 100mA and CHG threshold to 50mA
	format_uint16(writeData, 0x000A);
	RAMRegisterWrite(SET_CURRTH_DSG_CURRTH, writeData, 2);
	format_uint16(writeData, 0x0005);
	RAMRegisterWrite(SET_CURRTH_CHG_CURRTH, writeData, 2);

	/**
	 * Cell balancing settings registers
	 */
	writeData[0] = 0x0F;
	RAMRegisterWrite(SET_CLBCFG_CONFIG, writeData, 1); // Exits SLEEP to perform balancing, allow balancing while charging and in relax mode
	writeData[0] = 0x0A;
	RAMRegisterWrite(SET_CLBCFG_CB_INTRVL, writeData, 1); // Recalculates which cells to balance every 10 seconds
	writeData[0] = 0x08;
	RAMRegisterWrite(SET_CLBCFG_CB_MAX_CLS, writeData, 1); // Allows up to 8 cells to be balanced at once
	// Min. cell voltage must be at least 2500mV for cell balancing to occur while charging or in relax mode
	format_uint16(writeData, 0x09C4);
	RAMRegisterWrite(SET_CLBCFG_CHG_MIN_V, writeData, 2);
	RAMRegisterWrite(SET_CLBCFG_RLX_MIN_V, writeData, 2);

	/**
	 * Power registers
	 */
	format_uint16(writeData, 0x0960);
	RAMRegisterWrite(PWR_SHDN_BATT_V, writeData, 2); // If pack voltage falls below 24000mV, AFE enters SHUTDOWN mode
	format_uint16(writeData, 0x000A);
	RAMRegisterWrite(PWR_SLP_CURR, writeData, 2); // Current above 10mA will cause device to exit SLEEP mode
	format_uint16(writeData, 0x0960);
	RAMRegisterWrite(PWR_SLP_CHG_V_THLD, writeData, 2); // If pack voltage falls below 24000mV, SLEEP mode is blocked when charger detected

	/**
	 * Protections registers (testing only)
	 */
//	writeData[0] = 0x1A;
//	RAMRegisterWrite(PROT_CUV_THLD, writeData, 1); // CUV triggered at 1.265V, cleared above 1.3662V
//	writeData[0] = 0x23;
//	RAMRegisterWrite(PROT_COV_THLD, writeData, 1); // COV triggered at 1.771V, cleared below 1.6698V

	/**
	 * Protections registers
	 */
	writeData[0] = 0x23;
	RAMRegisterWrite(PROT_CUV_THLD, writeData, 1); // CUV triggered at 1.771V, cleared above 1.8732V
	writeData[0] = 0x37;
	RAMRegisterWrite(PROT_COV_THLD, writeData, 1); // COV triggered at 2.783V, cleared below 2.6818V
	writeData[0] = 0x08;
	RAMRegisterWrite(PROT_OCC_THLD, writeData, 1); // OCC triggered at 16A
	writeData[0] = 0x15;
	RAMRegisterWrite(PROT_OCD1_THLD, writeData, 1); // OCD1 triggered at 42A
	writeData[0] = 0x64;
	RAMRegisterWrite(PROT_OCD1_DLY, writeData, 1); // OCD1 triggered after 340ms delay
	writeData[0] = 0x19;
	RAMRegisterWrite(PROT_OCD2_THLD, writeData, 1); // OCD2 triggered at 50A
	writeData[0] = 0x1C;
	RAMRegisterWrite(PROT_OCD2_DLY, writeData, 1); // OCD2 triggered after 100ms delay
	writeData[0] = 0x03;
	RAMRegisterWrite(PROT_SCD_THLD, writeData, 1); // SCD triggered at 60A
	RAMRegisterWrite(PROT_SCD_DLY, writeData, 1); // SCD triggered after 30µs delay
	writeData[0] = 0xEC;
	RAMRegisterWrite(PROT_UTD_THLD, writeData, 1); // UTD triggered at -20ºC
	RAMRegisterWrite(PROT_UTC_THLD, writeData, 1); // UTC triggered at -20ºC
	writeData[0] = 0xF1;
	RAMRegisterWrite(PROT_UTD_RCVR, writeData, 1); // UTD cleared above -15ºC
	RAMRegisterWrite(PROT_UTC_RCVR, writeData, 1); // UTC cleared above -15ºC
}

/**
 * Handles the proper SPI communication procedure with the AFE for a SPI read command
 * @param txBytes Pointer to array containing the data to transmit
 * @param rxBytes Pointer to array containing the data to be received
 * @param arrSize Number of bytes that will be transmitted/received
 */
void AFETransmitReadCmd(uint8_t *txBytes, uint8_t *rxBytes, uint8_t arrSize) {
	// Continuously transmit the SPI transaction until the AFE has received it
	bool commReceived = false;
	uint8_t readBytes[2] = {0};
	uint8_t crcReceived = 0;
	while (!commReceived)
	{
		// Pull NSS low
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
		// Transmit data and receive AFE's response
		HAL_SPI_TransmitReceive(&hspi1, txBytes, rxBytes, arrSize, HAL_MAX_DELAY);

