far-mat42/custom-escooter/BMS PCB/Testing/STM32 Testing Ground/Nucleo-Test-Ground-2/Core/Src/main.c
		// For read command, confirm the AFE received the command by checking the address and CRC bytes
//		if (txBytes[0] == rxBytes[0]) commReceived = true;
		readBytes[0] = rxBytes[0];
		readBytes[1] = rxBytes[1];
		crcReceived = crc8(readBytes, 2);
		if (txBytes[0] == rxBytes[0] && crcReceived == rxBytes[2]) commReceived = true;

		// Pull NSS high and wait for transaction to be processed
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
		HAL_Delay(1);
	}

}

/**
 * Handles the proper SPI communication procedure with the AFE for a SPI write command
 * @param txBytes Pointer to array containing the data to transmit
 * @param rxBytes Pointer to array containing the data to be received
 * @param arrSize Number of bytes that will be transmitted/received
 */
void AFETransmitWriteCmd(uint8_t *txBytes, uint8_t *rxBytes, uint8_t arrSize) {
	// Continuously transmit the SPI transaction until the AFE has received it
	bool commReceived = false;
	while (!commReceived)
	{
		// Pull NSS low
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);
		// Transmit data and receive AFE's response
		HAL_SPI_TransmitReceive(&hspi1, txBytes, rxBytes, arrSize, HAL_MAX_DELAY);

		// For write command, confirm the AFE received the command by checking every single byte
		commReceived = true;
		for (int i = 0; i < arrSize; i++)
		{
			if (txBytes[i] != rxBytes[i]) commReceived = false; // If any mismatch occurs, flag it and retransmit
		}

		// Pull NSS high and wait for transaction to be processed
		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
		HAL_Delay(1);
	}
}

/**
 * Helper function to begin transmission of logging information with the current timestamp
 */
void TransmitLogAndTimestamp(void) {
	char buffer[512] = {0}; // Initialize buffer to store message
	char temp[48]; // Temporary buffer for each line

	// Preparing a heading for the data log
	snprintf(temp, sizeof(temp), "**************************************\n\r");
	strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
	snprintf(temp, sizeof(temp), "************ BMS DATA LOG ************\n\r");
	strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
	snprintf(temp, sizeof(temp), "**************************************\n\r");
	strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);

	// Logging the timestamp
	snprintf(temp, sizeof(temp), "Timestamp: ");
	strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
	GetDateTime(temp, sizeof(temp)); // Getting the current date and time
	strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
	snprintf(temp, sizeof(temp), "\n\n\r");
	strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);

	// Transmit the final message over UART
	HAL_UART_Transmit(&huart1, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
}

/**
 * Helper function to transmit all the cell voltage readings over UART
 * @param volts Array containing the cell and pack voltage readings
 * @param len Length of the provided array
 */
void TransmitCellPackVoltages(uint16_t *volts, uint8_t len) {
	char buffer[1024] = {0}; // Initialize buffer to store message
	char temp[32]; // Temporary buffer for each line

	uint8_t lines = 0;
	uint8_t entriesPerLine = 5;

	// Preparing a heading for the current reading
	snprintf(temp, sizeof(temp), "******** VOLTAGE ********\n\r");
	strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);

	// Calculate how many lines to make based on number of voltage readings (8 readings per line max.)
	if (len % entriesPerLine == 0) lines = len / entriesPerLine;
	else lines = len / entriesPerLine + 1;

	for (int i = 0; i < lines; i++) {
		// First write out the cell numbers
		for (int j = 1; j <= entriesPerLine; j++) {
			if ((i*entriesPerLine + j) > len) break; // Break once number of voltage readings has been reached
			// Different header for the last entry (pack voltage)
			if ((i*entriesPerLine + j) == len) {
				snprintf(temp, sizeof(temp), "VBAT\t\t");
				strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
			}
			else {
				snprintf(temp, sizeof(temp), "CV%d\t\t", (i*entriesPerLine + j));
				strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
			}
		}
		snprintf(temp, sizeof(temp), "\n\r");
		strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
		// On the following line, write out the cell voltage readings
		for (int j = 1; j <= entriesPerLine; j++) {
			if ((i*entriesPerLine + j) > len) break; // Break once number of voltage readings has been reached
			// Alternate handling for data for pack voltage to write it in volts instead of mV
			if ((i*entriesPerLine + j) == len) {
				snprintf(temp, sizeof(temp), "%d.%dV\t\t", volts[i*entriesPerLine + j - 1] / 100, volts[i*entriesPerLine + j - 1] % 100);
				strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
			}
			else {
				snprintf(temp, sizeof(temp), "%dmV\t\t", volts[i*entriesPerLine + j - 1]);
				strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
			}
		}
		snprintf(temp, sizeof(temp), "\n\n\r");
		strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
	}

	// Transmit the final message over UART
	HAL_UART_Transmit(&huart1, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
}

void TransmitADCReadings(uint32_t *counts, uint8_t len) {
	char buffer[1024] = {0}; // Initialize buffer to store message
	char temp[32]; // Temporary buffer for each line

	for (int i = 1; i <= len; i++) {
		// Format the data into a single line
		snprintf(temp, sizeof(temp), "CV%d: %lu mV\n\r", i, counts[i-1]);
		// Append the formatted data to the buffer
		strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
	}

	// Transmit the final message over UART
	HAL_UART_Transmit(&huart1, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
}

/**
 * Helper function to transmit the battery current reading over UART
 * @param current CC2 current reading - negative for discharging, positive for charging
 */
void TransmitCurrentReading(int16_t current) {
	char buffer[128] = {0}; // Initialize buffer to store message
	char temp[32] = {0}; // Temporary buffer for each line

	// Preparing a heading for the current reading
	snprintf(temp, sizeof(temp), "******** CURRENT ********\n\r");
	strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);

	// Determine if charging or discharging based on current value
	if (current > 0) {
		snprintf(temp, sizeof(temp), "CC2: Charging at %d mA\n\n\r", current*10);
	}
	else {
		snprintf(temp, sizeof(temp), "CC2: Discharging at %d mA\n\n\r", current*(-10));
	}
	strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
	HAL_UART_Transmit(&huart1, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
}

/**
 * Helper function to transmit all the temperature readings over UART
 * @param temps Array containing the temperature readings
 * @param len Length of the provided array
 */
void TransmitTemperatures(int16_t *temps, uint8_t len) {
	char buffer[1024] = {0}; // Initialize buffer to store message
	char temp[32]; // Temporary buffer for each line

	// Separate variables for integer part and decimal part of temperature reading
	int16_t degC = 0;
	int16_t deg_int = 0;
	int16_t deg_dec = 0;

	// Preparing a heading for the temperature readings
	snprintf(temp, sizeof(temp), "******** TEMPERATURE ********\n\r");
	strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);

