far-mat42/custom-escooter/BMS PCB/Testing/STM32 Testing Ground/Nucleo-Test-Ground-2/Core/Src/main.c
	// Tabulating the temperature sensors
	for (int i = 1; i <= len; i++) {
		snprintf(temp, sizeof(temp), "TS%d\t\t", i);
		strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
	}

	snprintf(temp, sizeof(temp), "\n\r");
	strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);

	for (int i = 1; i <= len; i++) {
		// Convert from Kelvin into Celsius
		degC = temps[i-1] - 2731;
		deg_int = degC / 10;
		deg_dec = degC % 10;
		// If temperature is negative, keep the decimal part positive
		if (degC < 0 && deg_dec != 0) deg_dec = abs(deg_dec);

		snprintf(temp, sizeof(temp), "%d.%dºC\t\t", deg_int, deg_dec);
		strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);
	}

	snprintf(temp, sizeof(temp), "\n\n\r");
	strncat(buffer, temp, sizeof(buffer) - strlen(buffer) - 1);

	// Transmit the final message over UART
	HAL_UART_Transmit(&huart1, (uint8_t*)buffer, strlen(buffer), HAL_MAX_DELAY);
}

/**
 * Helper function to transmit UART messages corresponding to any faults detected in the
 * Safety Status A register
 */
void TransmitSafetyStatusA(void) {
	// Read the bits of the Safety Status A register and transmit the appropriate message
	// if the corresponding fault was triggered
	uint8_t statusA[1] = {0};
	DirectCmdRead(0x03, statusA, 1);

	// Short Circuit Discharge
	if (statusA[0] & (1 << 7)) {
		uint8_t msg[] = "SCD fault triggered! Discharging will be disabled for a moment...\n\r";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Overcurrent in Discharge 1st Tier
	if (statusA[0] & (1 << 5)) {
		uint8_t msg[] = "OCD1 fault triggered! Discharging will be disabled for a moment...\n\r";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Overcurrent in Charge
	if (statusA[0] & (1 << 4)) {
		uint8_t msg[] = "OCC fault triggered! Charging will be disabled for a moment...\n\r";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Cell Overvoltage
	if (statusA[0] & (1 << 3)) {
		uint8_t msg[] = "COV fault triggered! Charging will be disabled until voltage drops sufficiently.\n\r";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Cell Undervoltage
	if (statusA[0] & (1 << 2)) {
		uint8_t msg[] = "CUV fault triggered! Discharging will be disabled until voltage rises sufficiently.\n\r";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
}

/**
 * Helper function to transmit UART messages corresponding to any faults detected in the
 * Safety Status B register
 */
void TransmitSafetyStatusB(void) {
	// Read the bits of the Safety Status B register and transmit the appropriate message
	// if the corresponding fault was triggered
	uint8_t statusB[1] = {0};
	DirectCmdRead(0x05, statusB, 1);

	// FET Overtemperature
	if (statusB[0] & (1 << 7)) {
		uint8_t msg[] = "OTF fault triggered! Discharging will be disabled for a moment...\n\r";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Internal Overtemperature
	if (statusB[0] & (1 << 6)) {
		uint8_t msg[] = "OTINT fault triggered! All AFE operations will be disabled for a moment...\n\r";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Overtemperature in Discharge
	if (statusB[0] & (1 << 5)) {
		uint8_t msg[] = "OTD fault triggered! Discharging will be disabled for a moment...\n\r";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Overtemperature in Charge
	if (statusB[0] & (1 << 4)) {
		uint8_t msg[] = "OTC fault triggered! Charging will be disabled for a moment...\n\r";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Internal Undertemperature
	if (statusB[0] & (1 << 2)) {
		uint8_t msg[] = "UTINT fault triggered! All AFE operations will be disabled for a moment...\n\r";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Undertemperature in Discharge
	if (statusB[0] & (1 << 1)) {
		uint8_t msg[] = "UTD fault triggered! No operational changes, but prolonged operation is not advised.\n\r";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
	// Undertemperature in Charge
	if (statusB[0] & 0x01) {
		uint8_t msg[] = "UTC fault triggered! No operational changes, but prolonged operation is not advised.\n\r";
		HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);
	}
}

/**
 * Commands the AFE to enter deep-sleep mode, then enters shutdown mode
 */
void EnterShutdown(void) {
	// Sending out a message indicating BMS is shutting down
	uint8_t msg[] = "Shutting down the BMS...\n\n\r";
	HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);

	// Send AFE the DEEPSLEEP command twice in a row in order to put it in DEEPSLEEP
	SubCmdNoData(0x000F);
	SubCmdNoData(0x000F);

	// Process for putting STM32 into shutdown mode
	// Clear Wake-Up Flags
	PWR->SCR |= PWR_SCR_CWUF;

	// Enable pull-down for PB5 (status LED) when in shutdown
	PWR->CR1 |= PWR_CR1_DBP;
	PWR->PDCRB |= PWR_PDCRB_PB5;
	PWR->CR1 &= ~PWR_CR1_DBP;

	// Enable Wake-Up Pin for PA2
	PWR->CR3 |= PWR_CR3_EWUP2;

	// Set SHUTDOWN mode
	PWR->CR1 |= PWR_CR1_LPMS_SHUTDOWN;

	// Enter SHUTDOWN mode
	SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk; // Set DEEPSLEEP bit
	__DSB(); // Data Synchronization Barrier
	__WFI(); // Wait For Interrupt (enters SHUTDOWN mode)
}

/**
 * Measures the thermistor connected to the STM32's ADC and converts the reading to a temperature
 * @return Temperature of the thermistor in degrees Celsius
 */
int16_t T4_Acquire(void) {
    uint32_t adcValue = 0;
    float T4_volt = 0.0;
    float T4_res = 0.0;
    float T4_temp = 0.0;
    int16_t T4 = 0;

    // Start ADC conversion
    if (HAL_ADC_Start(&hadc1) != HAL_OK) {
        // Start error
        Error_Handler();
    }

    // Poll for end of conversion
    if (HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY) == HAL_OK) {
        // Read the ADC conversion result (12-bit resolution)
        adcValue = HAL_ADC_GetValue(&hadc1);

        // Convert ADC value to voltage (divide by max. ADC counts, multiply by VREF (3.3V))
        T4_volt = ((float)adcValue / 4095.0) * V_REF;
        // Calculate thermistor resistance based on voltage (voltage divider rearranged)
        T4_res = T4_PU_R * (T4_volt / (T4_PU_V - T4_volt));
        // Using thermistor's beta value, calculate the temperature
        T4_temp = 1.0 / ((1.0 / 298.15) + (log(T4_res / T4_R0)) / T4_BETA);
        // Convert value in Kelvin to 16-bit integer like the other temperature measurements (units of 0.1K)
        T4 = (int16_t)(T4_temp * 10.0);
    }

    // Stop the ADC conversion
    HAL_ADC_Stop(&hadc1);

    return T4;
}

time_t RTCToUnixTimestamp(RTC_DateTypeDef *date, RTC_TimeTypeDef *time) {
	struct tm tm_time;

