far-mat42/custom-escooter/BMS PCB/Testing/STM32 Testing Ground/Nucleo-Test-Ground-2/Core/Src/main.c
	// Populate the tm structure
	tm_time.tm_year = date->Year + 100; // Years since 1900
	tm_time.tm_mon  = date->Month - 1;  // Months since January
	tm_time.tm_mday = date->Date;       // Day of the month
	tm_time.tm_hour = time->Hours;
	tm_time.tm_min  = time->Minutes;
	tm_time.tm_sec  = time->Seconds;
	tm_time.tm_isdst = -1;              // No daylight saving time

	// Convert to UNIX timestamp
	return mktime(&tm_time);
}

/**
 * Helper function to get the current date and time and format it into a string
 * @param datetimeStr String to store the date & time in
 * @param size Size of the string (char array)
 */
void GetDateTime(char *datetimeStr, size_t size) {
	time_t now;
	struct tm *timeinfo;

	// Get the current time
	time(&now);

	// Convert the time to local time structure
	timeinfo = localtime(&now);

	// Format the time as a string
	strftime(datetimeStr, size, "%Y-%m-%d %H:%M:%S", timeinfo);
}

/**
 * Implementation of _gettimeofday using the STM32's RTC
 */
int _gettimeofday(struct timeval *tv, void *tzvp) {
    RTC_TimeTypeDef sTime;
    RTC_DateTypeDef sDate;

    // Get the current RTC time and date
    if (HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN) != HAL_OK || HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN) != HAL_OK) {
        return -1; // Error reading RTC
    }

    // Convert to UNIX timestamp
    time_t timestamp = RTCToUnixTimestamp(&sDate, &sTime);

    // Populate the timeval structure
    if (tv) {
        tv->tv_sec = timestamp; // Seconds since the Unix epoch
        tv->tv_usec = 0;       // Microseconds (RTC typically doesn't support this)
    }

    return 0;
}

/**
 * Error handler if a UART transmission error occurs
 * TODO: Implement this
 */
void Error_Handler(void) {
    // Stay in an infinite loop to allow for debugging
    while (1);
}

/**
 * Callback function for handling an interrupt from a GPIO pin
 * @param GPIO_Pin The GPIO pin number where an interrupt was received
 */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
	uint8_t msg[] = "Interrupt! ";
	HAL_UART_Transmit(&huart1, msg, sizeof(msg) - 1, HAL_MAX_DELAY);

	switch (GPIO_Pin) {
	case GPIO_PIN_4:
		logAlertsFlag = true;
	}
}
